hiperiondev/esp32idf_APRS/components/webconfig/pages/page_radio.c
// @file page_radio.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief Web admin "Radiomodem" page: renders and saves the modem configuration,
// re-applying it live without a reboot, and runs the DAC-to-ADC loopback self
// test.

#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "app_config.h"
#include "aprs_service.h"
// hal/adc_types.h for ADC_ATTEN_DB_12: the component's config header defines
// MODEM_ADC_ATTEN as that enumerator but does not include its declaration (its
// own .c files pull in the ADC driver first), so a translation unit that
// *uses* the macro has to bring the enum in itself.
#include "hal/adc_types.h"

#include "afsk.h"
#include "esp32idf_radioamateur_modem.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "esp_log.h"
#include "pages.h"
#include "translations.h"
#include "web_common.h"
#include "web_help.h"

static const char *TAG = "page_radio";

// Renders the FX.25 mode field as a 3-option select (Off / Receive only /
// Receive and transmit), mirroring render_duplex_select() in page_digi.c for
// the same tri-state-field-as-select pattern.
static void render_fx25_mode_select(httpd_req_t *req, const char *name, uint8_t fx25_mode) {
    int cur = fx25_mode > 2 ? 2 : fx25_mode;
    web_select_open(req, TR_F_FX_25_FORWARD_ERROR_CORRECTED_AX_25, name);
    web_select_option(req, 0, TR_F_OFF, cur == 0);
    web_select_option(req, 1, TR_F_FX25_RX_ONLY, cur == 1);
    web_select_option(req, 2, TR_F_FX25_RX_TX, cur == 2);
    web_select_close(req);
}

// PTT GPIO is a fixed, compile-time-only board wiring choice (MODEM_PTT_GPIO,
// an internal radiomodem feature - like the audio ADC/DAC pins above, it is
// supplied by the top-level CMakeLists.txt) and therefore has no <select>
// here. Its active level (MODEM_PTT_ACTIVE_HIGH) is likewise a
// compile-time-only board wiring choice - there is no runtime <select>
// or checkbox for it either - and is surfaced read-only in the compile-time
// audio hardware info block below. The fixed pin is surfaced through
// web_gpio_owner_tag() (see web_common.c's GPIO registry) so it correctly
// shows up as "used" - labelled "PTT" - in every other GPIO picker on this
// admin (e.g. Message Alarm).

esp_err_t page_radio_get(httpd_req_t *req) {
    if (!web_check_auth(req))
        return ESP_OK;
    web_send_header(req, TR_F_RADIO_MODEM, "radio");
    httpd_resp_sendstr_chunk(req, "<form method='POST' action='/radio' id='radioForm'>");

    web_fieldset_open(req, TR_F_PROTOCOL);
    render_fx25_mode_select(req, "fx25Mode", g_config.fx25_mode);
    web_fieldset_close(req);

    web_fieldset_open(req, TR_F_AUDIO_AFSK);
    {
        char hlp[WEB_HELP_MARKUP_MAX];
        web_help_markup(hlp, sizeof(hlp), web_help_for_label(TR_F_ENABLE_AUDIO_MODEM));
        // The margin over the help markup covers the fixed part of the label:
        // the flex wrapper, the checkbox, the enable caption and the three
        // diagnostic buttons with their captions.
        char buf[WEB_HELP_MARKUP_MAX + 760];
        snprintf(buf, sizeof(buf),
                 "<label style='display:flex;align-items:center;gap:10px;flex-wrap:wrap;'>"
                 "<span><input type='checkbox' name='audioModemEn' %s> " TR_F_ENABLE_AUDIO_MODEM "%s</span>"
                 "<button type='button' class='secondary' id='loopTestBtn' onclick='loopTest()'>" TR_BTN_LOOP_TEST "</button>"
                 "<button type='button' class='secondary' id='rxLevelBtn' onclick='rxLevel()'>" TR_BTN_RX_LEVEL "</button>"
                 "<button type='button' class='secondary' id='txTestBtn' onclick='txTest()'>" TR_BTN_TX_TEST "</button>"
                 "<span id='loopTestStatus'></span>"
                 "</label>",
                 g_config.audio_modem_en ? "checked" : "", hlp);
        httpd_resp_sendstr_chunk(req, buf);
    }
    web_select_open(req, TR_F_AFSK_MODULATION, "afskModem");
    web_select_option(req, 0, "300 Bd (AFSK)", g_config.afsk_modem_type == 0);
    web_select_option(req, 1, "1200 Bd (AFSK/Bell202)", g_config.afsk_modem_type == 1);
    web_select_option(req, 2, "1200 Bd (AFSK/V.23)", g_config.afsk_modem_type == 2);
    web_select_option(req, 3, "9600 Bd (G3RUH/FSK)", g_config.afsk_modem_type == 3);
    web_select_close(req);
    // The ADC attenuation is shown read-only: esp32idf_radioamateur_modem
    // takes it and both audio pins as compile-time constants, so an editable
    // input would save to flash and change nothing. The values shown are the
    // ones actually compiled in. The receive gate and gain are runtime
    // settings of the Receive demodulator section below.
    // PTT's GPIO (MODEM_PTT_GPIO) and its active level (MODEM_PTT_ACTIVE_HIGH)
    // are both fixed, compile-time-only board wiring choices - like the
    // ADC/DAC pins - supplied by the top-level CMakeLists.txt, so neither is
    // a selectable or checkbox field. Both are folded into the same read-only
    // compile-time info block as the ADC/DAC pins below, one item per line, so
    // the operator can see the whole audio/PTT hardware picture without digging
    // through the build files. The block reports the ADC sample rate, which the
    // DSP filter design is built around and which nothing can change at run
    // time, and not the DAC one: the transmit rate is a saved setting, chosen
    // by the "Transmit sample rate" selector further down this page and applied
    // from g_config at the next modem_init(), so a compile-time constant shown
    // here would contradict the operator's own choice.
    {
        char ptt_pin_buf[16];
        if (MODEM_PTT_GPIO >= 0)
            snprintf(ptt_pin_buf, sizeof(ptt_pin_buf), "GPIO%d", MODEM_PTT_GPIO);
        else
            snprintf(ptt_pin_buf, sizeof(ptt_pin_buf), "%s", TR_DISABLED);

        char buf[900];
        snprintf(buf, sizeof(buf), "<p style='opacity:.75'><b>" TR_RADIO_AUDIO_HW_TITLE "</b>: " TR_RADIO_AUDIO_HW_INFO TR_RADIO_AUDIO_HW_NOTE "</p>",
                 MODEM_DAC_GPIO, MODEM_ADC_GPIO, ptt_pin_buf, MODEM_PTT_ACTIVE_HIGH ? TR_ENABLED : TR_F_OFF, (int)MODEM_ADC_ATTEN, MODEM_ADC_SAMPLERATE);
        httpd_resp_sendstr_chunk(req, buf);
    }
    web_field_checkbox(req, TR_F_FLAT_AUDIO_INPUT, "audioLPF", g_config.audio_lpf);
    web_field_int(req, TR_F_PREAMBLE_MS, "rfPreamble", g_config.preamble, RF_PREAMBLE_MS_MIN, RF_PREAMBLE_MS_MAX);
    web_field_int(req, TR_F_TX_TIME_SLOT_MS, "txTimeSlot", g_config.tx_timeslot, RF_TX_TIMESLOT_MS_MIN, RF_TX_TIMESLOT_MS_MAX);
    // How many frames may queue in the RF TX ring (waiting to key up or on
    // the air right now) before a new packet is dropped instead of queued -
    // see RF_TX_BUFFERS_MIN/MAX in aprs_service.h and g_config.rf_tx_buffers
    // in aprs_service.c. Applied live on Save (no reboot): the value is read
    // straight off g_config on every transmit. The dropdown's range comes
    // from the same RF_TX_BUFFERS_MIN/MAX used to clamp the saved value
    // below, so it can never offer a choice larger than the ring can hold.
    web_select_open(req, TR_F_RF_TX_BUFFERS, "rfTxBuffers");
    for (int i = RF_TX_BUFFERS_MIN; i <= RF_TX_BUFFERS_MAX; i++) {
        char label[4];
        snprintf(label, sizeof(label), "%d", i);
        web_select_option(req, i, label, g_config.rf_tx_buffers == i);
    }
    web_select_close(req);
    // Long-term TX duty-cycle ceiling: bounds this station's own cumulative
    // transmit airtime over the rolling window aprs_service.c measures it
    // over, independent of the CSMA channel-access settings above (which
    // only prevent collisions and have no memory of past transmissions).
    // Off by default; when enabled, non-critical RF TX (own-station beacons,
    // objects/items, weather, telemetry, bulletins, bulk IGate INET->RF
    // relay) is held back once the ceiling is reached, while APRS messages/
    // acks and digipeat repeats keep transmitting. Applied live on Save, same
    // as rfPreamble/txTimeSlot above - see g_config.duty_cycle_en/duty_cycle_pct.
    web_field_checkbox(req, TR_F_DUTY_CYCLE_EN, "dutyCycleEn", g_config.duty_cycle_en);
    web_field_int(req, TR_F_DUTY_CYCLE_PCT, "dutyCyclePct", g_config.duty_cycle_pct, DUTY_CYCLE_PCT_MIN, DUTY_CYCLE_PCT_MAX);
    // Extra minimum PTT-off (unkeyed) hold time between transmissions, in
    // milliseconds, on top of the fixed one-service-tick release holdoff the
    // modem always applies (~10 ms). Useful for radios/repeaters that need a
    // longer guaranteed unkey gap between frames than the fixed floor gives
    // (e.g. to clear a repeater's courtesy tone or squelch tail before the
    // next packet keys up). 0 disables the extra hold. Applied live on Save,
    // same as rfPreamble/txTimeSlot above - see g_config.ptt_min_unkey_ms.
    web_field_int(req, TR_F_PTT_MIN_UNKEY_MS, "pttMinUnkeyMs", g_config.ptt_min_unkey_ms, PTT_MIN_UNKEY_MS_MIN, PTT_MIN_UNKEY_MS_MAX);
    // CSMA/p-persistent channel-access probability (standard AX.25/KISS
    // "Persist"): once the channel is heard clear, the modem transmits
    // immediately with probability csmaPersist/256 on every slot and
    // otherwise waits one more txTimeSlot before rolling again. 255
    // transmits on the first clear slot every time (equivalent to plain
    // non-persistent CSMA); lower values spread contending stations'
    // key-ups further apart. Applied live on Save, same as rfPreamble/
    // txTimeSlot above - see g_config.csma_persist.
    web_field_int(req, TR_F_CSMA_PERSISTENCE, "csmaPersist", g_config.csma_persist, CSMA_PERSIST_MIN, CSMA_PERSIST_MAX);
    web_fieldset_close(req);

    // Receive chain of the modem: which demodulators run and with which
    // prefilters (1200 Bd profiles), plus the receive gate, high-pass, gain
    // control and bit repair every profile uses. All of it is applied live on
    // Save through modem_set_modem(); the ranges come from the modem
    // component's MODEM_RX_* limits, the same ones
    // modem_rx_tuning_sanitize() enforces on the posted and the stored values.
    {
        const modem_rx_tuning_t *t = &g_config.rx_tuning;

        web_fieldset_open(req, TR_F_RX_DEMODULATOR);
        web_select_open(req, TR_F_RX_EQ_PRESET, "rxEqPreset");
        web_select_option(req, MODEM_RX_EQ_LEGACY, TR_F_RX_EQ_LEGACY, t->eq_preset == MODEM_RX_EQ_LEGACY);
        web_select_option(req, MODEM_RX_EQ_SINGLE, TR_F_RX_EQ_SINGLE, t->eq_preset == MODEM_RX_EQ_SINGLE);
        web_select_option(req, MODEM_RX_EQ_DIVERSITY2, TR_F_RX_EQ_DIV2, t->eq_preset == MODEM_RX_EQ_DIVERSITY2);
        web_select_option(req, MODEM_RX_EQ_DIVERSITY3, TR_F_RX_EQ_DIV3, t->eq_preset == MODEM_RX_EQ_DIVERSITY3);
        web_select_option(req, MODEM_RX_EQ_MULTISLICE, TR_F_RX_EQ_MULTI, t->eq_preset == MODEM_RX_EQ_MULTISLICE);
        web_select_option(req, MODEM_RX_EQ_CUSTOM, TR_F_RX_EQ_CUSTOM, t->eq_preset == MODEM_RX_EQ_CUSTOM);
        web_select_close(req);
        web_field_int(req, TR_F_RX_EQ_COUNT, "rxEqCount", t->custom_count, 1, MODEM_RX_MAX_PREFILTERS);
        web_field_int(req, TR_F_RX_TILT_1, "rxTilt0", t->custom_tilt_db[0], MODEM_RX_TILT_DB_MIN, MODEM_RX_TILT_DB_MAX);
        web_field_int(req, TR_F_RX_TILT_2, "rxTilt1", t->custom_tilt_db[1], MODEM_RX_TILT_DB_MIN, MODEM_RX_TILT_DB_MAX);
        web_field_int(req, TR_F_RX_TILT_3, "rxTilt2", t->custom_tilt_db[2], MODEM_RX_TILT_DB_MIN, MODEM_RX_TILT_DB_MAX);
        web_field_int(req, TR_F_RX_BPF_LO_HZ, "rxBpfLoHz", t->bpf_lo_hz, MODEM_RX_BPF_LO_HZ_MIN, MODEM_RX_BPF_LO_HZ_MAX);
        web_field_int(req, TR_F_RX_BPF_HI_HZ, "rxBpfHiHz", t->bpf_hi_hz, MODEM_RX_BPF_HI_HZ_MIN, MODEM_RX_BPF_HI_HZ_MAX);
        web_field_int(req, TR_F_RX_BPF_TAPS, "rxBpfTaps", t->bpf_taps, MODEM_RX_BPF_TAPS_MIN, MODEM_RX_BPF_TAPS_MAX);
        web_field_int(req, TR_F_RX_GATE_MV, "rxGateMv", t->gate_mv, 0, MODEM_RX_GATE_MV_MAX);
        web_select_open(req, TR_F_RX_HPF_HZ, "rxHpfHz");
        web_select_option(req, 0, TR_F_OFF, t->hpf_hz == 0);
        web_select_option(req, 150, "150 Hz", t->hpf_hz == 150);
        web_select_option(req, 300, "300 Hz", t->hpf_hz == 300);
        web_select_option(req, 400, "400 Hz", t->hpf_hz == 400);
        web_select_close(req);
        web_select_open(req, TR_F_RX_AGC_MODE, "rxAgcMode");
        web_select_option(req, MODEM_RX_AGC_AUTO, TR_F_RX_AGC_AUTO, t->agc_mode == MODEM_RX_AGC_AUTO);
        web_select_option(req, MODEM_RX_AGC_FIXED, TR_F_RX_AGC_FIXED, t->agc_mode == MODEM_RX_AGC_FIXED);
        web_select_close(req);
        web_field_int(req, TR_F_RX_AGC_GAIN_DB, "rxAgcGainDb", t->agc_fixed_gain_db, MODEM_RX_AGC_GAIN_DB_MIN, MODEM_RX_AGC_GAIN_DB_MAX);
        web_select_open(req, TR_F_RX_FIX_BITS, "rxFixBits");
        web_select_option(req, 0, TR_F_OFF, t->fix_bits == 0);
        web_select_option(req, 1, TR_F_RX_FIX_SYMBOL, t->fix_bits == 1);
        web_select_option(req, 2, TR_F_RX_FIX_SYMBOL_BIT, t->fix_bits == 2);
        web_select_close(req);
        web_fieldset_close(req);
    }

