hiperiondev/esp32idf_APRS/components/webconfig/pages/page_radio.c
    // Everything that describes what sits between the ADC/DAC pins and the
    // transceiver. The defaults suit an interface board carrying its own bias
    // network, attenuators and reconstruction filter, which is what the
    // schematics in docs/ show; the settings here are what an interface
    // reduced to a coupling capacitor and a level trimmer per direction needs
    // instead. All of them are applied live on Save except the transmit sample
    // rate, which is programmed while the modem hardware is stopped and so
    // takes effect at the next reboot.
    web_fieldset_open(req, TR_F_AUDIO_INTERFACE);
    web_field_checkbox(req, TR_F_ADC_SELF_BIAS, "adcSelfBias", g_config.adc_self_bias);
    web_field_checkbox(req, TR_F_RX_CLIP_WARN, "rxClipWarn", g_config.rx_clip_warn);
    web_field_int(req, TR_F_DAC_AMPLITUDE_PCT, "dacAmplPct", g_config.dac_amplitude_pct, DAC_AMPL_PCT_MIN, DAC_AMPL_PCT_MAX);
    web_select_open(req, TR_F_DAC_SAMPLERATE, "dacRate");
    web_select_option(req, DAC_SAMPLERATE_LOW, "38400 Hz", g_config.dac_samplerate == DAC_SAMPLERATE_LOW);
    web_select_option(req, DAC_SAMPLERATE_HIGH, "76800 Hz", g_config.dac_samplerate == DAC_SAMPLERATE_HIGH);
    web_select_close(req);
    web_field_int(req, TR_F_TX_MAX_KEYED_MS, "txMaxKeyedMs", (int)g_config.tx_max_keyed_ms, TX_MAX_KEYED_MS_MIN, TX_MAX_KEYED_MS_MAX);
    web_fieldset_close(req);

    httpd_resp_sendstr_chunk(req, "<script>"
                                  "function loopTest(){"
                                  "var btn=document.getElementById('loopTestBtn');"
                                  "var status=document.getElementById('loopTestStatus');"
                                  "btn.disabled=true;status.style.color='';status.textContent=' " TR_LOOPTEST_SAVING "';"
                                  // Save the current form state first, then run the test, so what's
                                  // on screen is always what gets tested rather than whatever was last
                                  // saved to flash.
                                  "var form=document.getElementById('radioForm');"
                                  "var params=new URLSearchParams(new FormData(form));"
                                  "fetch('/radio',{method:'POST',body:params}).then(function(){radioSaved=params.toString();"
                                  "status.textContent=' " TR_LOOPTEST_RUNNING "';"
                                  // POST, not GET: this route keys the transmitter, so it is
                                  // registered POST-only and goes through the same-origin check.
                                  "return fetch('/radio/looptest',{method:'POST'});"
                                  "}).then(function(r){return r.json();}).then(function(data){"
                                  "btn.disabled=false;"
                                  "status.style.color=data.ok?'green':'red';"
                                  "status.textContent=' '+data.msg;"
                                  "}).catch(function(){btn.disabled=false;status.style.color='red';status.textContent=' " TR_LOOPTEST_FAILED "';});"
                                  "}"
                                  // Receive level and bias measurement. Nothing is transmitted, so
                                  // unlike the loop test it can be run with a transceiver connected
                                  // and while real traffic is being decoded. What is on screen is
                                  // what gets measured: the form is saved first, but only when it
                                  // differs from what was last loaded or saved, because a save
                                  // writes to flash and a changed receive setting rebuilds the
                                  // demodulators, and either would disturb the reception being
                                  // measured.
                                  "var radioSaved=null;"
                                  "function radioFormState(){"
                                  "return new URLSearchParams(new FormData(document.getElementById('radioForm'))).toString();"
                                  "}"
                                  "window.addEventListener('load',function(){radioSaved=radioFormState();});"
                                  "function rxLevel(){"
                                  "var btn=document.getElementById('rxLevelBtn');"
                                  "var status=document.getElementById('loopTestStatus');"
                                  "btn.disabled=true;status.style.color='';"
                                  "var state=radioFormState(),save;"
                                  "if(state===radioSaved){save=Promise.resolve();}"
                                  "else{status.textContent=' " TR_LOOPTEST_SAVING "';"
                                  "save=fetch('/radio',{method:'POST',body:new URLSearchParams(state)}).then(function(){radioSaved=state;});}"
                                  "save.then(function(){"
                                  "status.textContent=' " TR_LOOPTEST_RUNNING "';"
                                  "return fetch('/radio/level',{method:'POST'});"
                                  "}).then(function(r){return r.json();}).then(function(data){"
                                  "btn.disabled=false;"
                                  "if(!data.ok){status.style.color='red';status.textContent=' '+data.msg;return;}"
                                  "var lv={clip:['" TR_RADIO_RX_LEVEL_CLIP "','red'],idle:['" TR_RADIO_RX_LEVEL_IDLE "',''],"
                                  "low:['" TR_RADIO_RX_LEVEL_LOW "','darkorange'],good:['" TR_RADIO_RX_LEVEL_GOOD "','green']}[data.level]||[data.level,''];"
                                  "status.style.color=lv[1];"
                                  "var n=data.demods||0,dec=[],uni=[];"
                                  "for(var i=0;i<n;i++){dec.push(data.decoded[i]);uni.push(data.unique[i]);}"
                                  "status.textContent=' " TR_RADIO_RX_LEVEL " '+lv[0]+'; " TR_RADIO_RX_TONES
                                  " '+data.band_mVrms+' mV RMS (peak '+data.band_peak_mVrms+')'"
                                  "+', '+data.mVrms+' mV RMS (peak '+data.peak_mVrms+'), DC '+data.dc_mV"
                                  "+' mV, AGC '+data.agc+'x, raw '+data.raw_min+'..'+data.raw_max+', DCD '+(data.dcd?'yes':'no')"
                                  "+'; " TR_RADIO_RX_STATS_DECODED " '+dec.join('/')+', " TR_RADIO_RX_STATS_UNIQUE " '+uni.join('/')"
                                  "+', " TR_RADIO_RX_STATS_DELIVERED " '+data.delivered+', " TR_RADIO_RX_STATS_REPAIRED " '+data.repaired"
                                  "+', " TR_RADIO_RX_STATS_LOST " '+data.fifo_drops+'/'+data.pool_ovf;"
                                  "}).catch(function(){btn.disabled=false;status.style.color='red';status.textContent=' " TR_LOOPTEST_FAILED "';});"
                                  "}"
                                  // Bounded transmit burst. POST for the same reason as the loop
                                  // test: it keys the transmitter.
                                  "function txTest(){"
                                  "var btn=document.getElementById('txTestBtn');"
                                  "var status=document.getElementById('loopTestStatus');"
                                  "btn.disabled=true;status.style.color='';status.textContent=' " TR_LOOPTEST_SAVING "';"
                                  "var form=document.getElementById('radioForm');"
                                  "var params=new URLSearchParams(new FormData(form));"
                                  "fetch('/radio',{method:'POST',body:params}).then(function(){radioSaved=params.toString();"
                                  "status.textContent=' " TR_LOOPTEST_RUNNING "';"
                                  "return fetch('/radio/txtest',{method:'POST'});"
                                  "}).then(function(r){return r.json();}).then(function(data){"
                                  "btn.disabled=false;"
                                  "status.style.color=data.ok?'green':'red';"
                                  "status.textContent=' '+data.msg;"
                                  "}).catch(function(){btn.disabled=false;status.style.color='red';status.textContent=' " TR_LOOPTEST_FAILED "';});"
                                  "}"
                                  "</script>");

    httpd_resp_sendstr_chunk(req, "<button type='submit'>" TR_BTN_SAVE "</button></form>");
    web_send_footer(req);
    return ESP_OK;
}

// POST /radio/looptest - runs the audio ADC/DAC AFSK modem self-test (see
// aprs_loop_test_run()) and returns the result as JSON:
// {"ok":true/false,"msg":"..."}. Requires the ADC/DAC GPIOs to be wired
// together as a physical audio loopback.
//
// POST rather than GET, even though it reads like a query: the test keys the
// transmitter and puts a self-test frame on the air, which makes it a
// state-changing request. web_check_auth() runs its same-origin check on those
// only, so a GET route here would be reachable cross-origin - any page an
// authenticated admin happened to have open could key this station's radio
// with an <img src> pointing at it, because the browser attaches cached Basic
// credentials to such a request. POST also puts the route out of reach of the
// other ways a browser fetches a URL on its own (script/stylesheet loads,
// prefetch, link prerender, address-bar navigation).
esp_err_t page_radio_looptest_post(httpd_req_t *req) {
    if (!web_check_auth_admin(req))
        return ESP_OK;
    httpd_resp_set_type(req, "application/json");

    // 900, not 512: aprs_loop_test_run()'s failure messages are long - they
    // quote raw ADC min/max, RMS, AGC gain, the DCD bitmap and per-demodulator
    // levels, plus a paragraph of interpretation. They are plain prose: the
    // modem exposes no failed-frame buffer, so nothing here dumps raw bytes.
    char result[900];
    bool ok = aprs_loop_test_run(result, sizeof(result));

    // Stream the JSON response as it is escaped rather than building the
    // whole "msg" value in one buffer first: the result text can echo back
    // raw RX payload bytes on a mismatch, which are not guaranteed to be
    // JSON-safe, so every byte is still escaped, just in small flushed
    // batches instead of one combined allocation.
    char head[24];
    snprintf(head, sizeof(head), "{\"ok\":%s,\"msg\":\"", ok ? "true" : "false");
    httpd_resp_sendstr_chunk(req, head);

    char esc[128];
    size_t o = 0;
    for (size_t i = 0; result[i] != 0; i++) {
        unsigned char c = (unsigned char)result[i];
        if (o + 2 > sizeof(esc) - 1) {
            esc[o] = 0;
            httpd_resp_sendstr_chunk(req, esc);
            o = 0;
        }
        if (c == '"' || c == '\\') {
            esc[o++] = '\\';
            esc[o++] = (char)c;
        } else if (c == '\n') {
            esc[o++] = '\\';
            esc[o++] = 'n';
        } else if (c < 0x20) {
            continue; // drop other control chars
        } else {
            esc[o++] = (char)c;
        }
    }
    esc[o] = 0;
    httpd_resp_sendstr_chunk(req, esc);

    httpd_resp_sendstr_chunk(req, "\"}");
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
}

// POST /radio/level - measures the receive level and input bias (see
// aprs_rx_level_sample()) and returns the reading as JSON. Nothing is
// transmitted, so this is the measurement to use once a transceiver has
// replaced the ADC/DAC jumper the loop test needs.
//
// POST rather than GET: the measurement claims the modem's diagnostics for a
// second, which makes it a state-changing request, and web_check_auth() runs
// its same-origin check on POST only - the same reasoning as
// page_radio_looptest_post() above.
//
// The response is sent as produced. Every field in it is a number or a fixed
// keyword generated locally, so unlike the loop test's result there is no
// received payload in it to escape.
esp_err_t page_radio_level_post(httpd_req_t *req) {
    if (!web_check_auth_admin(req))
        return ESP_OK;
    httpd_resp_set_type(req, "application/json");

    // Sized for the widest reading the object can hold - every field is a
    // number of known width or a fixed keyword plus the fixed keys, the
    // receive statistics being five fixed counters plus two arrays of up to
    // MODEM_RX_MAX_DEMODULATORS 10-digit entries, about 510 bytes in all -
    // with room for the failure form, which is shorter.
    char result[768];
    aprs_rx_level_sample(result, sizeof(result));
    httpd_resp_sendstr(req, result);
    return ESP_OK;
}

// POST /radio/txtest - transmits a bounded test burst (see aprs_tx_test_run())
// and returns the result as JSON: {"ok":true/false,"msg":"..."}. The
// transmit-side counterpart of /radio/level: it keys up so the deviation can
// be measured on other equipment, and waits for nothing to come back.
//
// POST for the same reason as the loop test: this one puts a carrier on the
// air.
esp_err_t page_radio_txtest_post(httpd_req_t *req) {
    if (!web_check_auth_admin(req))
        return ESP_OK;
    httpd_resp_set_type(req, "application/json");

