hiperiondev/esp32idf_APRS/components/webconfig/pages/page_radio.c
    char result[320];
    bool ok = aprs_tx_test_run(result, sizeof(result));

    // The message is assembled from fixed prose and the station's own
    // settings, so it carries nothing received off the air - but the quote and
    // backslash escapes are still applied, since it is rendered straight into
    // a JSON string.
    httpd_resp_sendstr_chunk(req, ok ? "{\"ok\":true,\"msg\":\"" : "{\"ok\":false,\"msg\":\"");

    char esc[128];
    size_t o = 0;
    for (size_t i = 0; result[i] != 0; i++) {
        unsigned char c = (unsigned char)result[i];
        if (o + 2 > sizeof(esc) - 1) {
            esc[o] = 0;
            httpd_resp_sendstr_chunk(req, esc);
            o = 0;
        }
        if (c == '"' || c == '\\') {
            esc[o++] = '\\';
            esc[o++] = (char)c;
        } else if (c < 0x20) {
            continue;
        } else {
            esc[o++] = (char)c;
        }
    }
    esc[o] = 0;
    httpd_resp_sendstr_chunk(req, esc);

    httpd_resp_sendstr_chunk(req, "\"}");
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
}

esp_err_t page_radio_post(httpd_req_t *req) {
    if (!web_check_auth_admin(req))
        return ESP_OK;
    char body[1600];
    if (web_read_body(req, body, sizeof(body)) < 0) {
        httpd_resp_send_500(req);
        return ESP_OK;
    }

    // These two are parsed here and stored below, inside app_config_lock(),
    // together with the rest of the form: every write to g_config on this page
    // happens under the lock, so the whole page lands as one update as far as
    // any concurrent reader is concerned.
    // fx25Mode selects 0=off, 1=RX only, 2=RX+TX - clamp defensively since
    // Ax25Init() only defines behavior for 0-2, same reasoning as afskModem
    // below.
    int fx25_mode_in = web_form_get_int(body, "fx25Mode", g_config.fx25_mode);
    if (fx25_mode_in < 0)
        fx25_mode_in = 0;
    else if (fx25_mode_in > 2)
        fx25_mode_in = 2;
    bool audio_modem_en_in = web_form_get_bool(body, "audioModemEn");

    // afskModem selects the AFSK software modem modulation (300/1200/1200 V.23/9600 Bd)
    // used for both RX and TX on the audio ADC/DAC modem - clamp defensively since
    // modem_mode_t only defines values 0-3 (AFSK300/BELL202/V23/G3RUH).
    int afsk_modem_in = web_form_get_int(body, "afskModem", g_config.afsk_modem_type);
    if (afsk_modem_in < 0)
        afsk_modem_in = 0;
    else if (afsk_modem_in > 3)
        afsk_modem_in = 3;
    app_config_lock();
    g_config.fx25_mode = (uint8_t)fx25_mode_in;
    g_config.audio_modem_en = audio_modem_en_in;
    g_config.afsk_modem_type = (uint8_t)afsk_modem_in;
    // adcAtten is not posted by the form (see the read-only note in
    // page_radio_get()); the compiled-in value is displayed read-only.
    g_config.audio_lpf = web_form_get_bool(body, "audioLPF");

    // Receive demodulator. A field missing from the POST keeps its stored
    // value; modem_rx_tuning_sanitize() clamps whatever was posted into the
    // ranges the modem accepts, so a malformed POST can never store a value
    // the demodulator would be built from unchecked.
    {
        modem_rx_tuning_t t = g_config.rx_tuning;
        t.eq_preset = (modem_rx_eq_preset_t)web_form_get_int(body, "rxEqPreset", t.eq_preset);
        t.custom_count = (uint8_t)web_form_get_int(body, "rxEqCount", t.custom_count);
        for (int i = 0; i < MODEM_RX_MAX_PREFILTERS; i++) { // one tilt field per prefilter the Custom set can design
            char key[8];
            snprintf(key, sizeof(key), "rxTilt%d", i);
            int v = web_form_get_int(body, key, t.custom_tilt_db[i]);
            t.custom_tilt_db[i] = (int8_t)((v < -128) ? -128 : (v > 127) ? 127 : v);
        }
        int lo = web_form_get_int(body, "rxBpfLoHz", t.bpf_lo_hz);
        int hi = web_form_get_int(body, "rxBpfHiHz", t.bpf_hi_hz);
        int taps = web_form_get_int(body, "rxBpfTaps", t.bpf_taps);
        int gate = web_form_get_int(body, "rxGateMv", t.gate_mv);
        int hpf = web_form_get_int(body, "rxHpfHz", t.hpf_hz);
        int gain = web_form_get_int(body, "rxAgcGainDb", t.agc_fixed_gain_db);
        int fix = web_form_get_int(body, "rxFixBits", t.fix_bits);
        t.bpf_lo_hz = (uint16_t)((lo < 0) ? 0 : (lo > 65535) ? 65535 : lo);
        t.bpf_hi_hz = (uint16_t)((hi < 0) ? 0 : (hi > 65535) ? 65535 : hi);
        t.bpf_taps = (uint8_t)((taps < 0) ? 0 : (taps > 255) ? 255 : taps);
        t.gate_mv = (uint16_t)((gate < 0) ? 0 : (gate > 65535) ? 65535 : gate);
        t.hpf_hz = (uint16_t)((hpf < 0) ? 0 : (hpf > 65535) ? 65535 : hpf);
        t.agc_mode = (modem_rx_agc_mode_t)web_form_get_int(body, "rxAgcMode", t.agc_mode);
        t.agc_fixed_gain_db = (int8_t)((gain < -128) ? -128 : (gain > 127) ? 127 : gain);
        t.fix_bits = (uint8_t)((fix < 0) ? 0 : (fix > 255) ? 255 : fix);
        modem_rx_tuning_sanitize(&t);
        g_config.rx_tuning = t;
    }
    // rfPTT (PTT GPIO) and rfPTTAct (PTT active-high) are not posted by the
    // form: both are fixed at compile time (MODEM_PTT_GPIO and
    // MODEM_PTT_ACTIVE_HIGH) and can't be changed from here.
    // TXDelay/preamble length (RF_PREAMBLE_MS_MIN..RF_PREAMBLE_MS_MAX ms,
    // default 300) - clamp defensively, same reasoning as afskModem above,
    // because an out-of-range value from a malformed POST should never be
    // stored. Nothing downstream would catch it either:
    // aprs_service_build_modem_config() copies this straight into the modem
    // configuration and Ax25TxDelay() turns it into a flag-byte count, so at
    // 1200 Bd an unclamped 65535 would put roughly a minute of continuous
    // carrier ahead of every single frame - a station that holds a shared VHF
    // APRS channel open indefinitely. Bounds come from aprs_service.h so the
    // form's min/max, this clamp and the flash-load clamp cannot drift apart.
    int preamble_in = web_form_get_int(body, "rfPreamble", g_config.preamble);
    if (preamble_in < RF_PREAMBLE_MS_MIN)
        preamble_in = RF_PREAMBLE_MS_MIN;
    else if (preamble_in > RF_PREAMBLE_MS_MAX)
        preamble_in = RF_PREAMBLE_MS_MAX;
    g_config.preamble = (uint16_t)preamble_in;

    // CSMA slot time (RF_TX_TIMESLOT_MS_MIN..RF_TX_TIMESLOT_MS_MAX ms,
    // default 2000) - clamp defensively, same reasoning as rfPreamble above.
    // This is how long the modem waits before rolling the p-persistence dice
    // again on a busy channel, so an out-of-range value stalls this station's
    // own transmissions rather than the channel's.
    int tx_timeslot_in = web_form_get_int(body, "txTimeSlot", g_config.tx_timeslot);
    if (tx_timeslot_in < RF_TX_TIMESLOT_MS_MIN)
        tx_timeslot_in = RF_TX_TIMESLOT_MS_MIN;
    else if (tx_timeslot_in > RF_TX_TIMESLOT_MS_MAX)
        tx_timeslot_in = RF_TX_TIMESLOT_MS_MAX;
    g_config.tx_timeslot = (uint16_t)tx_timeslot_in;

    // RF TX ring backlog limit (RF_TX_BUFFERS_MIN..RF_TX_BUFFERS_MAX frames,
    // default 1) - clamp defensively, same as afskModem above, since this
    // drives an array-free bound check in aprs_service_send_tnc2() rather
    // than an array index, but an out-of-range value from a malformed POST
    // should still never be stored. Bounds come from aprs_service.h so this
    // can never drift from the TX ring's real usable depth (see the comment
    // there on AX25_TX_FRAME_RING_MAX).
    int rf_tx_buffers_in = web_form_get_int(body, "rfTxBuffers", g_config.rf_tx_buffers);
    if (rf_tx_buffers_in < RF_TX_BUFFERS_MIN)
        rf_tx_buffers_in = RF_TX_BUFFERS_MIN;
    else if (rf_tx_buffers_in > RF_TX_BUFFERS_MAX)
        rf_tx_buffers_in = RF_TX_BUFFERS_MAX;
    g_config.rf_tx_buffers = (uint8_t)rf_tx_buffers_in;

    // Long-term TX duty-cycle ceiling (DUTY_CYCLE_PCT_MIN..DUTY_CYCLE_PCT_MAX,
    // default 25, enforced only while dutyCycleEn is on) - clamp defensively
    // against a malformed POST, same reasoning as rf_tx_buffers above. See
    // g_config.duty_cycle_en/duty_cycle_pct and the accumulator in
    // aprs_service.c for how this is enforced.
    g_config.duty_cycle_en = web_form_get_bool(body, "dutyCycleEn");
    int duty_cycle_pct_in = web_form_get_int(body, "dutyCyclePct", g_config.duty_cycle_pct);
    if (duty_cycle_pct_in < DUTY_CYCLE_PCT_MIN)
        duty_cycle_pct_in = DUTY_CYCLE_PCT_MIN;
    else if (duty_cycle_pct_in > DUTY_CYCLE_PCT_MAX)
        duty_cycle_pct_in = DUTY_CYCLE_PCT_MAX;
    g_config.duty_cycle_pct = (uint8_t)duty_cycle_pct_in;

