hiperiondev/esp32idf_APRS/components/webconfig/pages/page_radio.c
    // Extra minimum PTT-off hold time between transmissions
    // (PTT_MIN_UNKEY_MS_MIN..PTT_MIN_UNKEY_MS_MAX ms, default 0 = disabled) -
    // clamp defensively against a malformed POST,
    // same reasoning as rf_tx_buffers above. See g_config.ptt_min_unkey_ms
    // and Ax25Config.minUnkeyTime in ax25.c for how this is enforced.
    int ptt_min_unkey_in = web_form_get_int(body, "pttMinUnkeyMs", g_config.ptt_min_unkey_ms);
    if (ptt_min_unkey_in < PTT_MIN_UNKEY_MS_MIN)
        ptt_min_unkey_in = PTT_MIN_UNKEY_MS_MIN;
    else if (ptt_min_unkey_in > PTT_MIN_UNKEY_MS_MAX)
        ptt_min_unkey_in = PTT_MIN_UNKEY_MS_MAX;
    g_config.ptt_min_unkey_ms = (uint16_t)ptt_min_unkey_in;

    // CSMA/p-persistent transmit probability (CSMA_PERSIST_MIN..
    // CSMA_PERSIST_MAX, default 63 = ~25%
    // chance per clear slot) - clamp defensively against a malformed POST,
    // same reasoning as rf_tx_buffers above. 0 is refused (it would key up
    // never, i.e. transmission would be permanently suppressed) rather than
    // silently coerced to a working value, so a bad input floors at
    // CSMA_PERSIST_MIN (lowest non-zero transmit probability) instead of
    // hiding the mistake.
    // See g_config.csma_persist and Ax25Config.persist in ax25.c for how
    // this is enforced.
    int csma_persist_in = web_form_get_int(body, "csmaPersist", g_config.csma_persist);
    if (csma_persist_in < CSMA_PERSIST_MIN)
        csma_persist_in = CSMA_PERSIST_MIN;
    else if (csma_persist_in > CSMA_PERSIST_MAX)
        csma_persist_in = CSMA_PERSIST_MAX;
    g_config.csma_persist = (uint8_t)csma_persist_in;

    // Audio interface. Both checkboxes default to off when absent from the
    // POST, which is what an unchecked box sends and also what an interface
    // board with its own bias network needs.
    g_config.adc_self_bias = web_form_get_bool(body, "adcSelfBias");
    g_config.rx_clip_warn = web_form_get_bool(body, "rxClipWarn");

    // Transmit output swing (DAC_AMPL_PCT_MIN..DAC_AMPL_PCT_MAX percent) -
    // clamp defensively against a malformed POST, same reasoning as
    // rf_tx_buffers above. The floor is what keeps the 8-bit converter from
    // being asked to draw a sine with a handful of steps: the attenuation a
    // microphone input needs belongs in an external attenuator.
    int dac_ampl_in = web_form_get_int(body, "dacAmplPct", g_config.dac_amplitude_pct);
    if (dac_ampl_in < DAC_AMPL_PCT_MIN)
        dac_ampl_in = DAC_AMPL_PCT_MIN;
    else if (dac_ampl_in > DAC_AMPL_PCT_MAX)
        dac_ampl_in = DAC_AMPL_PCT_MAX;
    g_config.dac_amplitude_pct = (uint8_t)dac_ampl_in;

    // Transmit sample rate. Only the two rates the modulator can divide
    // exactly at every supported baud rate are accepted; anything else falls
    // back to the standard one rather than being stored and refused later by
    // the modem.
    int dac_rate_in = web_form_get_int(body, "dacRate", (int)g_config.dac_samplerate);
    g_config.dac_samplerate = (dac_rate_in == DAC_SAMPLERATE_HIGH) ? DAC_SAMPLERATE_HIGH : DAC_SAMPLERATE_LOW;

    // Transmitter time-out (TX_MAX_KEYED_MS_MIN..TX_MAX_KEYED_MS_MAX ms, 0 =
    // disabled) - clamp defensively, same reasoning as rf_tx_buffers above.
    int tx_max_keyed_in = web_form_get_int(body, "txMaxKeyedMs", (int)g_config.tx_max_keyed_ms);
    if (tx_max_keyed_in < TX_MAX_KEYED_MS_MIN)
        tx_max_keyed_in = TX_MAX_KEYED_MS_MIN;
    else if (tx_max_keyed_in > TX_MAX_KEYED_MS_MAX)
        tx_max_keyed_in = TX_MAX_KEYED_MS_MAX;
    g_config.tx_max_keyed_ms = (uint32_t)tx_max_keyed_in;

    app_config_unlock();

    // The page rendered next is built from the live settings, so the save
    // result is what decides whether the operator is told this reached flash.
    bool ok = app_config_save_section(APP_CONFIG_SECTION_RADIO);
    if (!ok)
        ESP_LOGE(TAG, "radio/modem settings could not be written to flash");

    // Push every setting the modem accepts at runtime into the running modem,
    // so Save (and the loop test's auto-save, which POSTs this form before
    // running) takes effect without a reboot: modulation, preamble, time slot,
    // CSMA persistence, flat-audio flag, FX.25 mode, the PTT minimum unkey
    // time and the receive demodulator settings all go through
    // modem_set_modem().
    //
    // rfTxBuffers and the duty-cycle settings need no propagation into the
    // modem component at all: aprs_service_send_tnc2()/send_tnc2_impl()
    // (above modem.c, in this same binary) read g_config.rf_tx_buffers and
    // g_config.duty_cycle_en/duty_cycle_pct straight off g_config on every
    // call, so they are already live the instant app_config_unlock() runs,
    // before this function is even reached.
    //
    // audioModemEn still needs a reboot: modem_init() only runs at boot, from
    // main.c, and this no-ops until it has. dacRate is in the same position
    // for a different reason: the sample-clock period and every phase step
    // derived from it are programmed while the modem hardware is stopped, so
    // modem_init() is what applies it.
    aprs_service_apply_modem_config();

    web_send_save_result(req, ok, "/radio");
    return ESP_OK;
}
